Revit 2024 API
Family.ShowSpatialElementCalculationPoint Property
 For families that can have a calculation point for spatial elements, hide or show the calculation point. SpatialElementCalculationPoint elements.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public bool ShowSpatialElementCalculationPoint { get; set; }
Visual Basic
Public Property ShowSpatialElementCalculationPoint As Boolean
	Get
	Set
Visual C++
public:
property bool ShowSpatialElementCalculationPoint {
	bool get ();
	void set (bool value);
}
See Also
Family Class
Autodesk.Revit.DB Namespace